In [6]:
import sqlite3 as sl

In [7]:
con1 = sl.connect('sql_invoicing_1.db')

payment_methods table

In [8]:
with con1:
 
 con1.execute("""
    CREATE TABLE payment_methods (
        payment_method_id INTEGER NOT NULL  PRIMARY KEY AUTOINCREMENT,
        name varchar(50) NOT NULL
);
    """)

In [9]:
payment_methods_1 = 'INSERT INTO payment_methods (payment_method_id, name) values(?, ?)'
data = [(1,'Credit Card'),
        (2,'Cash'),
        (3,'PayPal'),
        (4,'Wire Transfer')]
with con1:
    con1.executemany(payment_methods_1,data)

clients table

In [10]:
with con1:
 
 con1.execute("""
  CREATE TABLE `clients` (
  `client_id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `address` varchar(50) NOT NULL,
  `city` varchar(50) NOT NULL,
  `state` char(2) NOT NULL,
  `phone` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`client_id`)
);
    """)

In [11]:
clients_1 = 'INSERT INTO clients (client_id,name,address,city,state,phone) values(?,?,?,?,?,?)'
clients_data = [(1,'Vinte','3 Nevada Parkway','Syracuse','NY','315-252-7305'),
                (2,'Myworks','34267 Glendale Parkway','Huntington','WV','304-659-1170'),
                (3,'Yadel','096 Pawling Parkway','San Francisco','CA','415-144-6037'),
                (4,'Kwideo','81674 Westerfield Circle','Waco','TX','254-750-0784'),
                (5,'Topiclounge','0863 Farmco Road','Portland','OR','971-888-9129')]
with con1:
    con1.executemany(clients_1,clients_data)

invoices table

In [12]:
with con1:
 
 con1.execute("""
  CREATE TABLE `invoices` (
  `invoice_id` int(11) NOT NULL,
  `number` varchar(50) NOT NULL,
  `client_id` int(11) NOT NULL,
  `invoice_total` decimal(9,2) NOT NULL,
  `payment_total` decimal(9,2) NOT NULL DEFAULT '0.00',
  `invoice_date` date NOT NULL,
  `due_date` date NOT NULL,
  `payment_date` date DEFAULT NULL,
  PRIMARY KEY (`invoice_id`)
  );
  """)

In [13]:
invoices_1 = 'INSERT INTO invoices (invoice_id,number,client_id,invoice_total,payment_total,invoice_date,due_date,payment_date) values(?,?,?,?,?,?,?,?)'
invoices_data = [(1,'91-953-3396',2,101.79,0.00,'2019-03-09','2019-03-29',None),
(2,'03-898-6735',5,175.32,8.18,'2019-06-11','2019-07-01','2019-06-30'),
(3,'20-228-0335',5,147.99,0.00,'2019-07-31','2019-08-20',None),
(4,'56-934-0748',3,152.21,0.00,'2019-03-08','2019-03-28',None),
(5,'87-052-3121',5,169.36,0.00,'2019-07-18','2019-08-07',None),
(6,'75-587-6626',1,157.78,74.55,'2019-01-29','2019-02-18','2019-02-20'),
(7,'68-093-9863',3,133.87,0.00,'2019-09-04','2019-09-24',None),
(8,'78-145-1093',1,189.12,0.00,'2019-05-20','2019-06-09',None),
(9,'77-593-0081',5,172.17,0.00,'2019-07-09','2019-07-29',None),
(10,'48-266-1517',1,159.50,0.00,'2019-06-30','2019-07-20',None),
(11,'20-848-0181',3,126.15,0.03,'2019-01-07','2019-01-27','2019-01-27'),
(13,'41-666-1035',5,135.01,87.44,'2019-06-25','2019-07-15','2019-07-13'),
(15,'55-105-9605',3,167.29,80.31,'2019-11-25','2019-12-15','2019-12-10'),
(16,'10-451-8824',1,162.02,0.00,'2019-03-30','2019-04-19',None),
(17,'33-615-4694',3,126.38,68.10,'2019-07-30','2019-08-19','2019-08-15'),
(18,'52-269-9803',5,180.17,42.77,'2019-05-23','2019-06-12','2019-06-08'),
(19,'83-559-4105',1,134.47,0.00,'2019-11-23','2019-12-13',None),]

with con1:
    con1.executemany(invoices_1,invoices_data)

###### payments table

In [14]:
with con1:
 
 con1.execute("""
  CREATE TABLE `payments` (
  `payment_id` integer NOT NULL PRIMARY KEY AUTOINCREMENT,
  `client_id` int(11) NOT NULL,
  `invoice_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `amount` decimal(9,2) NOT NULL,
  `payment_method` tinyint(4) NOT NULL
  );
  """)
    
payments_1 = 'INSERT INTO payments (payment_id,client_id,invoice_id,date,amount,payment_method) values(?,?,?,?,?,?)'
payments_data = [(1,5,2,'2019-02-12',8.18,1),
(2,1,6,'2019-01-03',74.55,1),
(3,3,11,'2019-01-11',0.03,1),
(4,5,13,'2019-01-26',87.44,1),
(5,3,15,'2019-01-15',80.31,1),
(6,3,17,'2019-01-15',68.10,1),
(7,5,18,'2019-01-08',32.77,1),
(8,5,18,'2019-01-08',10.00,2)]

with con1:
    con1.executemany(payments_1,payments_data)

##### products table

In [15]:
with con1:
 
 con1.execute("""
  CREATE TABLE `products` (
  `product_id` integer NOT NULL PRIMARY KEY AUTOINCREMENT,
  `name` varchar(50) NOT NULL,
  `quantity_in_stock` int(11) NOT NULL,
  `unit_price` decimal(4,2) NOT NULL)
  """)
    
products_1 = 'INSERT INTO products (product_id,name,quantity_in_stock,unit_price) values(?,?,?,?)'
products_data = [(1,'Foam Dinner Plate',70,1.21),
(2,'Pork - Bacon,back Peameal',49,4.65),
(3,'Lettuce - Romaine, Heart',38,3.35),
(4,'Brocolinni - Gaylan, Chinese',90,4.53),
(5,'Sauce - Ranch Dressing',94,1.63),
(6,'Petit Baguette',14,2.39),
(7,'Sweet Pea Sprouts',98,3.29),
(8,'Island Oasis - Raspberry',26,0.74),
(9,'Longan',67,2.26),
(10,'Broom - Push',6,1.09)]

with con1:
    con1.executemany(products_1,products_data)

##### shippers

In [16]:
with con1:
 
 con1.execute("""
  CREATE TABLE `shippers` (
  `shipper_id` integer NOT NULL PRIMARY KEY AUTOINCREMENT,
  `name` varchar(50) NOT NULL)
  """)
    
shippers_1 = 'INSERT INTO shippers (shipper_id,name) values(?,?)'
shippers_data = [(1,'Hettinger LLC'),
(2,'Schinner-Predovic'),
(3,'Satterfield LLC'),
(4,'Mraz, Renner and Nolan'),
(5,'Waters, Mayert and Prohaska')]

with con1:
    con1.executemany(shippers_1,shippers_data)

##### Customers

In [17]:
with con1:
    con1.execute("""
    
CREATE TABLE `customers` (
  `customer_id` integer NOT NULL  PRIMARY KEY AUTOINCREMENT,
  `first_name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `birth_date` date DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `address` varchar(50) NOT NULL,
  `city` varchar(50) NOT NULL,
  `state` char(2) NOT NULL,
  `points` int(11) NOT NULL DEFAULT '0')
  """)

In [18]:
customer_1 = 'INSERT INTO customers(customer_id,first_name, last_name,birth_date,phone,address,city,state,points) values(?,?,?,?,?,?,?,?,?)'
customer_data = [
(1,'Babara','MacCaffrey','1986-03-28','781-932-9754','0 Sage Terrace','Waltham','MA',2273),
(2,'Ines','Brushfield','1986-04-13','804-427-9456','14187 Commercial Trail','Hampton','VA',947),
(3,'Freddi','Boagey','1985-02-07','719-724-7869','251 Springs Junction','Colorado Springs','CO',2967),
(4,'Ambur','Roseburgh','1974-04-14','407-231-8017','30 Arapahoe Terrace','Orlando','FL',457),
(5,'Clemmie','Betchley','1973-11-07',None,'5 Spohn Circle','Arlington','TX',3675),
(6,'Elka','Twiddell','1991-09-04','312-480-8498','7 Manley Drive','Chicago','IL',3073),
(7,'Ilene','Dowson','1964-08-30','615-641-4759','50 Lillian Crossing','Nashville','TN',1672),
(8,'Thacher','Naseby','1993-07-17','941-527-3977','538 Mosinee Center','Sarasota','FL',205),
(9,'Romola','Rumgay','1992-05-23','559-181-3744','3520 Ohio Trail','Visalia','CA',1486),
(10,'Levy','Mynett','1969-10-13','404-246-3370','68 Lawn Avenue','Atlanta','GA',796)]

with con1:
    con1.executemany(customer_1,customer_data)

##### Order statuses

In [19]:
with con1:
 
 con1.execute("""
  CREATE TABLE `order_statuses` (
  `order_status_id` tinyint(4) NOT NULL,
  `name` varchar(50) NOT NULL,
  PRIMARY KEY (`order_status_id`))
  """)
    
order_status_1 = 'INSERT INTO order_statuses (order_status_id,name) values(?,?)'
order_status_data = [(1,'Processed'),
                    (2,'Shipped'),
                    (3,'Delivered')]

with con1:
    con1.executemany(order_status_1,order_status_data)

##### Orders

In [20]:
with con1:
 
 con1.execute("""
  CREATE TABLE `orders` (
  `order_id` integer NOT NULL PRIMARY KEY AUTOINCREMENT,
  `customer_id` int(11) NOT NULL,
  `order_date` date NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT '1',
  `comments` varchar(2000) DEFAULT NULL,
  `shipped_date` date DEFAULT NULL,
  `shipper_id` smallint(6) DEFAULT NULL)
  """)

In [21]:
orders_1 = 'INSERT INTO orders (order_id,customer_id,order_date,status,comments,shipped_date,shipper_id) values(?,?,?,?,?,?,?)'
orders_data = [(1,6,'2019-01-30',1,None,None,None),
(2,7,'2018-08-02',2,None,'2018-08-03',4),
(3,8,'2017-12-01',1,None,None,None),
(4,2,'2017-01-22',1,None,None,None),
(5,5,'2017-08-25',2,'','2017-08-26',3),
(6,10,'2018-11-18',1,'Aliquam erat volutpat. In congue.',None,None),
(7,2,'2018-09-22',2,None,'2018-09-23',4),
(8,5,'2018-06-08',1,'Mauris enim leo, rhoncus sed, vestibulum sit amet, cursus id, turpis.',None,None),
(9,10,'2017-07-05',2,'Nonea mollis molestie lorem. Quisque ut erat.','2017-07-06',1),
(10,6,'2018-04-22',2,None,'2018-04-23',2)]

with con1:
    con1.executemany(orders_1,orders_data)

##### Order Items

In [22]:
with con1:
 
 con1.execute("""
  CREATE TABLE `order_items` (
  `order_id` integer NOT NULL,
  `product_id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL,
  `unit_price` decimal(4,2) NOT NULL)
  """)

order_items_1 = 'INSERT INTO order_items (order_id,product_id,quantity,unit_price) values(?,?,?,?)'
order_items_data = [(1,4,4,3.74),
(2,1,2,9.10),
(2,4,4,1.66),
(2,6,2,2.94),
(3,3,10,9.12),
(4,3,7,6.99),
(4,10,7,6.40),
(5,2,3,9.89),
(6,1,4,8.65),
(6,2,4,3.28),
(6,3,4,7.46),
(6,5,1,3.45),
(7,3,7,9.17),
(8,5,2,6.94),
(8,8,2,8.59),
(9,6,5,7.28),
(10,1,10,6.01),
(10,9,9,4.28)]

with con1:
    con1.executemany(order_items_1,order_items_data)

##### order_item_notes

In [23]:
with con1:
 
 con1.execute("""
 CREATE TABLE `order_item_notes` (
  `note_id` INT NOT NULL,
  `order_Id` INT NOT NULL,
  `product_id` INT NOT NULL,
  `note` VARCHAR(255) NOT NULL,
  PRIMARY KEY (`note_id`))
  """)

In [24]:
order_items_notes_1 = 'INSERT INTO order_item_notes (note_id,order_Id,product_id,note) values(?,?,?,?)'
order_items_notes_data = [('1', '1', '2', 'first note'),
                          ('2', '1', '2', 'second note')]

with con1:
    con1.executemany(order_items_notes_1,order_items_notes_data)

##### Offices

In [25]:
with con1:
 
 con1.execute("""
 CREATE TABLE `offices` (
  `office_id` int(11) NOT NULL,
  `address` varchar(50) NOT NULL,
  `city` varchar(50) NOT NULL,
  `state` varchar(50) NOT NULL,
  PRIMARY KEY (`office_id`))
  """)

offices_1 = 'INSERT INTO offices (office_id,address,city,state) values(?,?,?,?)'
offices_data = [(1,'03 Reinke Trail','Cincinnati','OH'),
(2,'5507 Becker Terrace','New York City','NY'),
(3,'54 Northland Court','Richmond','VA'),
(4,'08 South Crossing','Cincinnati','OH')]

with con1:
    con1.executemany(offices_1,offices_data)

##### Employees

In [26]:
with con1:
 
 con1.execute("""
 CREATE TABLE `employees` (
  `employee_id` int(11) NOT NULL,
  `first_name` varchar(50) NOT NULL,
  `last_name` varchar(50) NOT NULL,
  `job_title` varchar(50) NOT NULL,
  `salary` int(11) NOT NULL,
  `reports_to` int(11) DEFAULT NULL,
  `office_id` int(11) NOT NULL,
  PRIMARY KEY (`employee_id`))
  """)

In [27]:
employees_1 = 'INSERT INTO employees (employee_id,first_name,last_name,job_title,salary,reports_to,office_id) values(?,?,?,?,?,?,?)'
employees_data = [(37270,'Yovonnda','Magrannell','Executive Secretary',63996,None,10),
(33391,'D\'arcy','Nortunen','Account Executive',62871,37270,1),
(37851,'Sayer','Matterson','Statistician III',98926,37270,1),
(40448,'Mindy','Crissil','Staff Scientist',94860,37270,1),
(56274,'Keriann','Alloisi','VP Marketing',110150,37270,1),
(63196,'Alaster','Scutchin','Assistant Professor',32179,37270,2),
(67009,'North','de Clerc','VP Product Management',114257,37270,2),
(67370,'Elladine','Rising','Social Worker',96767,37270,2),
(68249,'Nisse','Voysey','Financial Advisor',52832,37270,2),
(72540,'Guthrey','Iacopetti','Office Assistant I',117690,37270,3),
(72913,'Kass','Hefferan','Computer Systems Analyst IV',96401,37270,3),
(75900,'Virge','Goodrum','Information Systems Manager',54578,37270,3),
(76196,'Mirilla','Janowski','Cost Accountant',119241,37270,3),
(80529,'Lynde','Aronson','Junior Executive',77182,37270,4),
(80679,'Mildrid','Sokale','Geologist II',67987,37270,4),
(84791,'Hazel','Tarbert','General Manager',93760,37270,4),
(95213,'Cole','Kesterton','Pharmacist',86119,37270,4),
(96513,'Theresa','Binney','Food Chemist',47354,37270,5),
(98374,'Estrellita','Daleman','Staff Accountant IV',70187,37270,5),
(115357,'Ivy','Fearey','Structural Engineer',92710,37270,5)]

with con1:
    con1.executemany(employees_1,employees_data)

In [28]:
con1.close()